src/Test 40 Request.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:RegistryStoredQuery</a:Action>
        <h:PCEHRHeader xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xmlns:xsd="http://www.w3.org/2001/XMLSchema"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xml:id="header-0ab29b5e-a3e4-4109-b59c-d3cc768ec2c5">
            <User>
                <IDType>HPII</IDType>
                <ID>8003611566713495</ID>
                <userName>Mr Philip James Farman II</userName>
                <useRoleForAudit>false</useRoleForAudit>
            </User>
            <ihiNumber>8003608833648660</ihiNumber>
            <productType>
                <vendor>StrongRoom AI</vendor>
                <productName>StrongCare</productName>
                <productVersion>1.0</productVersion>
                <platform>CSP</platform>
            </productType>
            <clientSystemType>CSP</clientSystemType>
            <accessingOrganisation>
                <organisationID>8003623233372670</organisationID>
                <organisationName>Strong Room</organisationName>
            </accessingOrganisation>
        </h:PCEHRHeader>
        <h:signature xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0">
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#body-73fa6b40-1839-48d1-b657-6bb92a3f30d1">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>O+mgkZTmLNnjdI9+DkStxT8dUwI=</DigestValue>
                    </Reference>
                    <Reference URI="#header-0ab29b5e-a3e4-4109-b59c-d3cc768ec2c5">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>PDQJAlrCD8xqoRakazFGRi7m2Y8=</DigestValue>
                    </Reference>
                    <Reference URI="#timestamp-98ea2936-995f-430d-808f-96cd8f23b4d2">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>jR5lpxZTfhiNtifXBM5WmfZFsZc=</DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue>XZ0JDGC79a0gA0d9uvEL0g0LWrj8wBILBmwNL9puEuhc0SRfC4AnX4cVNjyKmX5sWkgnwfI3zWJcxl5mKZgR2whpv0WshYdBc56LT1kEkARFy22XxTYW5h0JqTjovFhx4DodaNUgjvVXPqBRsAIJ2iAUSf5nUMrAqqo62UpA1/L1Nj/KW9dDU+eAjs5FPOOukVsSjrGBVpkwf+0d4r+VT5NX/8SQJDYGgyC7yac9tQ4BUFVv1jrbagyujxKwMZbl2XjRQal9omIA8KKigSG4U1vUS6uP6Uo/Jn86G8gY3pugDA3T1fusCocceSTO7deksdlbgz2uIuj2wC1t3q8onQ==</SignatureValue>
                <KeyInfo>
                    <X509Data>
                        <X509Certificate>MIIGkDCCBXigAwIBAgICOyQwDQYJKoZIhvcNAQELBQAwejELMAkGA1UEBhMCQVUxDDAKBgNVBAoTA0dPVjEWMBQGA1UECxMNSHVtYW5zZXJ2aWNlczFFMEMGA1UEAxM8 VGVzdCBNZWRpY2FyZSBBdXN0cmFsaWEgT3JnYW5pc2F0aW9uIENlcnRpZmljYXRp b24gQXV0aG9yaXR5MB4XDTIzMDgyODAxMjIwN1oXDTI1MDgyODAxMjIwN1owgdIx EjAQBgoJkiaJk/IsZAEZFgJhdTETMBEGCgmSJomT8ixkARkWA25ldDEgMB4GCgmS JomT8ixkARkWEGVsZWN0cm9uaWNoZWFsdGgxEjAQBgoJkiaJk/IsZAEZFgJpZDEg MB4GCgmSJomT8ixkARkWEDgwMDM2MzMyMzMzNjkxNzAxETAPBgNVBAoTCENTUDEw MzMxMTwwOgYDVQQDEzNnZW5lcmFsLjgwMDM2MzMyMzMzNjkxNzAuaWQuZWxlY3Ry b25pY2hlYWx0aC5uZXQuYXUwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB AQDLFvV7W5/zH/VEcYNGDCJQM0ZFwOIioDCaSb4tteJIRw9ag12HLogFozYXpJ/c 87JlM9x7Xms4sPp9RH5Ln5nZ/H4V2bcH8AurquEoZG2sVJLMltCLvhgkw0ZhDNe0 2KSrGUqLSlFvtRswyMSe3CCRRGUJiNlmpkphVTs7ZEx8EZU1036BjK3kMktEy5a1 HfyoUrXVApZ4W2SpiUKl4pNU7kSXSAD375WyHmdHKbLOU3zvVnfiNBY6+mAJLEwU IF+uQf1jP0+fqWoUrWGEu0c0UzHSNi4iEYotZ4WQkj93tW1jE1Nh6f9LGX1ZeC2q H6V01L5FWoEhAfDTVM8pz/zTAgMBAAGjggLFMIICwTAMBgNVHRMBAf8EAjAAME8G CCsGAQUFBwEBBEMwQTA/BggrBgEFBQcwAYYzaHR0cDovL29jc3AuY2VydGlmaWNh dGVzLWF1c3RyYWxpYS5jb20uYXUvbWFvY2EucGt4MIIBHAYDVR0gBIIBEzCCAQ8w ggELBgoqJNL+gHcBFgEBMIH8MIHLBggrBgEFBQcCAjCBvhqBu0NlcnRpZmljYXRl cyBpc3N1ZWQgdW5kZXIgdGhpcyBDUCBtdXN0IG9ubHkgYmUgcmVsaWVkIG9uIGJ5 IGVudGl0aWVzIHdpdGhpbiB0aGUgQ29tbXVuaXR5IG9mIEludGVyZXN0LCB1bmxl c3Mgb3RoZXJ3aXNlIGFncmVlZCwgYW5kIG5vdCBmb3IgcHVycG9zZXMgb3RoZXIg dGhhbiB0aG9zZSBwZXJtaXR0ZWQgYnkgdGhpcyBDUC4wLAYIKwYBBQUHAgEWIGh0 dHA6Ly93d3cuaHVtYW5zZXJ2aWNlcy5nb3YuYXUvMBkGCSoko5CVFwHOGQQMFgo5 MTg1MjgzNTk2MA4GA1UdDwEB/wQEAwIEsDATBgNVHSUEDDAKBggrBgEFBQcDAjCB nAYDVR0jBIGUMIGRgBSvYN51YctPajChNpNGTWUzAIit7qF2pHQwcjELMAkGA1UE BhMCQVUxDDAKBgNVBAoTA0dPVjEWMBQGA1UECxMNSHVtYW5zZXJ2aWNlczE9MDsG A1UEAxM0VGVzdCBNZWRpY2FyZSBBdXN0cmFsaWEgUm9vdCBDZXJ0aWZpY2F0aW9u IEF1dGhvcml0eYIBBDBOBgNVHR8ERzBFMEOgQaA/hj1odHRwOi8vbWF0ZXN0LmNl cnRpZmljYXRlcy1hdXN0cmFsaWEuY29tLmF1L01BT0NBMi9sYXRlc3QuY3JsMBEG A1UdDgQKBAhA1qgYBrJOrjANBgkqhkiG9w0BAQsFAAOCAQEAyojZ9t1wy3u0Z1Sg kwPesMuaPKxibVoSHZ9GyffnBfu76Ed6/7UJUmUBF/pReEa8vDysGZuR5V9AaiGm XQNMmGOq+HsMlbOy6TEUb/LKJeIBfPgXPKsUKqdw0pSOM66emmbIypQTZVthiVQA Ia6NEpq/dbFSusgrWO0EhwrvsBo/QjxazfcX2qpCLzDCKYy2kGpLamVHHxsonC6W NWEmG4ib2cwDfcvjX4mGWZag6ZBed9/1RKsKCmylFs2mv3CX/7VZ25y90bbe5nmq em6gGh41/aHL4qG86NEqPseHtfjKmylY0K42Oe7ul8bVxX9+9m2DXqlfb9Dlq26U 39Qb8Q==
                        </X509Certificate>
                    </X509Data>
                </KeyInfo>
            </Signature>
        </h:signature>
        <h:timestamp xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0" xml:id="timestamp-98ea2936-995f-430d-808f-96cd8f23b4d2">
            <created>2024-04-11T09:03:26+10:00</created>
        </h:timestamp>
        <a:MessageID>urn:uuid:a03dc6c3-0f77-446e-aaf9-4f42d7a9b63d</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:From>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:From>
        <a:To s:mustUnderstand="1">http://www.w3.org/2005/08/addressing/anonymous</a:To>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xml:id="body-73fa6b40-1839-48d1-b657-6bb92a3f30d1">
        <AdhocQueryRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
            <ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
            <AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d"
                xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
                <Slot name="$XDSDocumentEntryPatientId">
                    <ValueList>
                        <Value>'8003608833648661^^^&amp;1.2.36.1.2001.1003.0&amp;ISO'</Value>
                    </ValueList>
                </Slot>
                <Slot name="$XDSDocumentEntryStatus">
                    <ValueList>
                        <Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</Value>
                    </ValueList>
                </Slot>
                <Slot name="$XDSDocumentEntryClassCode">
                    <ValueList>
                        <Value>('100.32049^^NCTIS Data Components')</Value>
                    </ValueList>
                </Slot>
                <Slot name="$XDSDocumentEntryServiceStopTimeFrom">
                    <ValueList>
                        <Value>20240201000000</Value>
                    </ValueList>
                </Slot>
                <Slot name="$XDSDocumentEntryServiceStopTimeTo">
                    <ValueList>
                        <Value>20240411235959</Value>
                    </ValueList>
                </Slot>
            </AdhocQuery>
        </AdhocQueryRequest>
    </s:Body>
</s:Envelope>